Revit 2027 API
DirectShapeType.Create Method
Overload List
Name | Description
Create(Document, String, ElementId) |  Creates a DirectShapeType element.
Create(Document, String, ElementId, DirectShapeTypeOptions) |  Creates a DirectShapeType element.
Top
See Also
Reference
DirectShapeType Class
Autodesk.Revit.DB Namespace